Revit 2026 API

# DocumentDifference Properties

---

The DocumentDifference type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AreDeletedElementIdsAvailable | Whether or the deleted elements were retrieved. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

DocumentDifference Class

Autodesk.Revit.DB Namespace